/*Тут скоріш за все є помилки, але я дуууже старалась)*/
#include <stdio.h>
#include <stdlib.h>

char * process(char * resultStr, /* Вказівник на строку, у яку запишеться результат*/
               const char * textLines[], /*  масив строк (текст)*/
               int linesNum, /*розмір масиву */
               const char * extraStr)/* Додаткова строка */{

    int i, num[100];
    int* es, vx, result[2];
    int numEs = sizeof(extraStr);       /*кількість елементів додаткової строки*/
    for(i=0; i < linesNum; i++){      /*лічильник строк основного тексту*/
        for(es = extraStr; es; es++){       /*лічильник елементів додатковой строки*/
            vx = strchr(textLines[i], es);                /*вкзівник на перше входження елемента додаткової строки в строку основного тексту*/
            if(vx){                     /*якщо є збіг..*/
                num[i]++;       /*кількість збігів строки "і" основного тексту з додатковою строкою*/
                if(num[i]==numEs) {      /*коли кількість збігів == кількості елементів додаткового рядка*/
                    result[0] = textLines[i];           /*присвоїти результату значення строки, яку шукали*/
                    result[1] = i; /*номер строки*/
                }
            }
        }
    }
    resultStr = result;
    return  resultStr;
}
/*strchr(s1, ch);
Повертає вказівник на перше входження символа ch у строку s1.*/
